In [1]:
import pandas as pd
df= pd.read_csv("HEIGHT.csv")
df.head()

    name  height
0  mohan     1.2
1  maria     2.3
2  sakib     4.9
3    tao     5.1
4  virat     5.2

In [9]:
Q1 = df.height.quantile(.25)
Q3 = df.height.quantile(.75)
Q1,Q2

(np.float64(5.3500000000000005), np.float64(6.275))

In [10]:
IQR = Q3 - Q1
IQR

np.float64(0.9249999999999998)

In [13]:
lower_limit = Q1 - 1.5*IQR
upper_limit = Q3 + 1.5*IQR
lower_limit, upper_limit

(np.float64(3.962500000000001), np.float64(7.6625))

In [14]:
df[df.height > upper_limit]

     name  height
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

In [15]:
df[df.height < lower_limit]

    name  height
0  mohan     1.2
1  maria     2.3

In [16]:
no_outlier=df[(df.height < upper_limit) & (df.height > lower_limit)]
no_outlier

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1

In [17]:
df.shape

(20, 2)

In [18]:
no_outlier.shape

(15, 2)